/**
 ให้เขียนโค้ดเพื่อนับจำนวนหลักเลขโดด
- รับค่าตัวเลขจากผู้ใช้งาน
- แสดงผลลัพธ์เป็นจำนวนหลักของตัวเลข
- เช่น
- ผู้ใช้งานกรอกตัวเลข 1150 ให้แสดงผลลัพธ์ 4 (มีเลข 4 ตัว)
- ผู้ใช้งานกรอกตัวเลข 123456789 ให้แสดงผลลัพธ์ 9 (มีเลข 9 ตัว) 
 */
// รับค่าตัวเลขจากผู้ใช้
let userInput = parseInt(prompt("กรุณากรอกตัวเลข:"));

// เริ่มต้นตัวแปรนับ
let result = 0;

// ใช้ while loop เพื่อนับจำนวนลักของตัวเลข
while (userInput !== 0) {
    userInput = Math.floor(userInput / 10);
    result++;
}
console.log("จำนวนลักของตัวเลขที่รับมาคือ " + result);